bt5docker/LaravelPj/app/Services/AuthService.php

    public function sendResetLink($email)
    {
        $user = $this->userRepository->findByEmail($email);
---
select * from `users` where `email` = 'vnvtn8@gmail.com' limit 1

    public function resetPassword(Request $request)
    {

        $request->validate([
            'email' => 'required|email',
            'password' => 'required|confirmed|min:8',
            'token' => 'required',
        ]);


        $user = $this->userRepository->findByEmail($request->email);


        if (!$user || !Password::tokenExists($user, $request->token)) {
            return false;
        }


        $user->password = Hash::make($request->password);
        $user->save();
---
update `users` set `password` = '$2y$12$vMNSAUpTM2UEl5lMMKM.G.WAeqCXKlr4ydP1jAqOFeW0jaS4QSAjm', `users`.`updated_at` = '2025-03-06 07:19:43' where `id` = 2